app/views/shared/_sidenav.html.erb

        <% if teacher_logged_in? %>
            <% Semester.all.each do | semester |%>
---
SELECT "semesters".* FROM "semesters"

                      <span class="glyphicon glyphicon-chevron-right"></span> <%= course.name %>
                      <span class="label label-info pull-right"><%= course.grades.where(:open=>false).length %></span>
---
SELECT "grades".* FROM "grades" WHERE "grades"."course_id" = $1 AND "grades"."open" = $2  [["course_id", 298486374], ["open", "f"]]