app/controllers/courses_controller.rb

  def selected
    @course = Course.find_by_id(params[:id])
    @grades=@course.grades.where(:open=>false)
    student = []
    @grades.each do |grade|
      if grade.open = true
        student<<User.find_by_id(grade.user_id)
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT 1  [["id", 298486374]]
SELECT "grades".* FROM "grades" WHERE "grades"."course_id" = $1 AND "grades"."open" = $2  [["course_id", 298486374], ["open", "f"]]
SELECT "users".* FROM "users" INNER JOIN "grades" ON "users"."id" = "grades"."user_id" WHERE "grades"."course_id" = $1  [["course_id", 298486374]]

  def chart
    @course = Course.find_by_id(params[:id])
    @grades=@course.grades.where(:open=>false)
    student = []
    @grades.each do |grade|
      if grade.open = true
        student<<User.find_by_id(grade.user_id)
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT 1  [["id", 298486374]]
SELECT "grades".* FROM "grades" WHERE "grades"."course_id" = $1 AND "grades"."open" = $2  [["course_id", 298486374], ["open", "f"]]
SELECT "users".* FROM "users" INNER JOIN "grades" ON "users"."id" = "grades"."user_id" WHERE "grades"."course_id" = $1  [["course_id", 298486374]]

  def select
    @course=Course.find_by_id(params[:id])
    current_user.courses<<@course
    Grade.create(:user_id => current_user.id, :course_id => @course.id)
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT 1  [["id", 298486374]]
INSERT INTO "grades" ("user_id", "course_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 430533587], ["course_id", 298486374], ["created_at", "2017-01-07 03:57:02.049412"], ["updated_at", "2017-01-07 03:57:02.049412"]]