app/controllers/notices_controller.rb

  def index
    @notice = Notice.all.order("updated_at DESC")
---
SELECT "notices".* FROM "notices"  ORDER BY updated_at DESC